In [1]:
import pandas as pd

In [2]:
data = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
        "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
        "Sales": [200, 120, 340, 124, 243, 350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [4]:
df.groupby("Company").describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [6]:
df = pd.DataFrame(data={"A": [8, 1, 10, 11], 
                        "B": [4, 5, 6, 7],
                        "C": [0, 1, 99, 3]})
df

    A  B   C
0   8  4   0
1   1  5   1
2  10  6  99
3  11  7   3

In [22]:
df.sort_values(by=1, axis=1)

    A   C  B
0   8   0  4
1   1   1  5
2  10  99  6
3  11   3  7

In [25]:
df.index.names = "d"

In [26]:
df

    A  B   C
d
0   8  4   0
1   1  5   1
2  10  6  99
3  11  7   3

In [27]:
df.isnull()

       A      B      C
d
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [29]:
df['A'].value_counts()

11    1
10    1
1     1
8     1
Name: A, dtype: int64

In [33]:
import numpy as np
outside = ["G1", "G1", "G1", "G2", "G2", "G2"]
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index


df2 = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A', 'B'])
df2

             A         B
G1 1 -1.257204  1.184579
   2  0.169863  0.224617
   3 -0.381593  0.705292
G2 1 -1.414163 -0.898020
   2  1.061651  1.191093
   3  0.762274 -0.408297

In [36]:
df2.loc["G1"].loc[3]["B"]

0.70529165626261237

In [40]:
df.sort_values(by="A", axis=0)

    A  B   C
d
1   1  5   1
0   8  4   0
2  10  6  99
3  11  7   3

In [41]:
df3 = pd.DataFrame({"A": [1, 2, np.nan],
                   "B": [5, np.nan, np.nan],
                   "C": [1, 2, 3]})

df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [43]:
data = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
        "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
        "Sales": [200, 120, 340, 124, 243, 350]}
df4 = pd.DataFrame(data)
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [45]:
df4.groupby("Company").sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [46]:
A = pd.DataFrame({"A": ["A0", "A1", "A2", "A3"],
                    "B": ["B0", "B1", "B2", "B3"],
                    "C": ["C0", "C1", "C2", "C3"],
                    "D": ["D0", "D1", "D2", "D3"]},
                  index=[0, 1, 2, 3])

In [47]:
B = pd.DataFrame({"A": ["A4", "A5", "A6", "A7"],
                    "B": ["B4", "B5", "B6", "B7"],
                    "C": ["C4", "C5", "C6", "C7"],
                    "D": ["D4", "D5", "D6", "D7"]},
                  index=[4, 5, 6, 7])

In [48]:
pd.concat([A, B])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [50]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [54]:
df['A'].nunique()

4

In [56]:
df3['A'].fillna(df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [58]:
df3.to_csv("test.csv")

In [59]:
df3["A"].value_counts()

2.0    1
1.0    1
Name: A, dtype: int64

In [60]:
df

    A  B   C
d
0   8  4   0
1   1  5   1
2  10  6  99
3  11  7   3

In [61]:
df.set_index("C")

     A  B
C
0    8  4
1    1  5
99  10  6
3   11  7

In [62]:
s = pd.Series(data=[1, 2, 3, 4], index=["a", "b", "c", "d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [63]:
s['a']

1

In [64]:
data = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
        "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
        "Sales": [200, 120, 340, 124, 243, 350]}
df5 = pd.DataFrame(data)
df5

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [66]:
df5.groupby(by="Company").describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [67]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [68]:
s2 = pd.Series(data=[1, 1, 1, 1], index=["a", "b", "e", "f"])

s + s2

a    2.0
b    3.0
c    NaN
d    NaN
e    NaN
f    NaN
dtype: float64

In [70]:
df3.fillna("s")

   A  B  C
0  1  5  1
1  2  s  2
2  s  s  3

In [73]:
df3.dropna(axis=1)

   C
0  1
1  2
2  3

In [72]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
pd.DataFrame(data=[[1, 2, np.nan], [3, np.nan, 5]])

   0    1    2
0  1  2.0  NaN
1  3  NaN  5.0

In [77]:
df

    A  B   C
d
0   8  4   0
1   1  5   1
2  10  6  99
3  11  7   3

In [78]:
df.loc[0, "A"]

8

In [80]:
df.drop("A", axis=1)

   B   C
d
0  4   0
1  5   1
2  6  99
3  7   3

In [82]:
df[df["B"] < 0]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [83]:
df

    A  B   C
d
0   8  4   0
1   1  5   1
2  10  6  99
3  11  7   3

In [84]:
df2 = pd.DataFrame(data=[[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])
df2

   A  B  C
0  1  2  3
1  4  5  6

In [89]:
df2.sum(axis=0)

A    5
B    7
C    9
dtype: int64

In [93]:
df2["A"].unique()

array([1, 4])

In [98]:
df3.dropna(axis=1)

   C
0  1
1  2
2  3

In [97]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(data={"A": [1, 2, np.nan], 
                   "B": [5, np.nan, np.nan],
                   "C": [1, 2, 3]})

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.reset_index()

   index    A    B  C
0      0  1.0  5.0  1
1      1  2.0  NaN  2
2      2  NaN  NaN  3

In [9]:
df['A'].nunique()

2

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(5, 4), index=["A", "B", "C", "D", "E"], columns=["W", "X", "Y", "Z"])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df[df['W'] > 0][["W", "X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
D  0.188695 -0.758872
E  0.190794  1.978757

In [22]:
df.drop("X", axis=1)

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [24]:
data = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
        "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
        "Sales": [200, 120, 340, 124, 243, 350]}
df2 = pd.DataFrame(data)
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [27]:
df2.groupby(by="Company").mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [29]:
df["W"].unique()

array([ 2.70684984,  0.65111795, -2.01816824,  0.18869531,  0.19079432])

In [32]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [35]:
df.loc["B", "Z"] = np.nan
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077       NaN
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.dropna(axis=1)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [44]:
df.sort_values(by="W", axis=0)

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
B  0.651118 -0.319318 -0.848077       NaN
A  2.706850  0.628133  0.907969  0.503826

In [46]:
df.drop("X", axis=1)

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077       NaN
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [50]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN       NaN
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df['W'].value_counts()

 0.651118    1
 0.190794    1
 2.706850    1
 0.188695    1
-2.018168    1
Name: W, dtype: int64

In [53]:
df.drop("W", axis=1)

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077       NaN
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [55]:
df2.groupby("Company").mean().loc["FB"]

Sales    296.5
Name: FB, dtype: float64

In [ ]:
pd.read_excel

In [58]:
df.dropna(axis=1)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [60]:
df.sort_values(by="W", axis=0)

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
B  0.651118 -0.319318 -0.848077       NaN
A  2.706850  0.628133  0.907969  0.503826

In [61]:
df.drop("W", axis=1)

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077       NaN
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [62]:
df['X'].value_counts()

-0.758872    1
 0.740122    1
 0.628133    1
-0.319318    1
 1.978757    1
Name: X, dtype: int64